Tekla.Structures.Filtering.DateTimeConstantFilterExpression
The DateTimeConstantFilterExpression class represents a constant DateTime filter expression.

Tekla.Structures.Filtering.DateTimeConstantFilterExpression.#ctor(System.DateTime)
Initializes a new instance of the DateTimeConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.DateTimeConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.DateTime})
Initializes a new instance of the DateTimeConstantFilterExpression class.
Values: The values to represent.

Tekla.Structures.Filtering.DateTimeConstantFilterExpression.#ctor(System.DateTime,System.IFormatProvider)
Initializes a new instance of the DateTimeConstantFilterExpression class.
Value: The value to represent.
Provider: An IFormatProvider object.

Tekla.Structures.Filtering.DateTimeConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.DateTime},System.IFormatProvider)
Initializes a new instance of the DateTimeConstantFilterExpression class.
Values: The values to represent.
Provider: An IFormatProvider object.